src_ext/InformationRegisters/УЗ_ЦеныТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_ЦеныТарифов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУроков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_ЦеныТарифов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЧасыТекстом = УЗ_ОбщийКлиентСервер.ЧасыМинуты(Запись.КоличествоЧасов, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ЗакрытьФорму");
КонецПроцедуры

//Часы вводятся строкой «ч:мм» (реквизит формы ЧасыТекстом), хранятся числом часов.
&НаКлиенте
Процедура КоличествоЧасовПриИзменении(Элемент)
	УЗ_ОбщийКлиентСервер.ПрименитьЧасыЦены(ЭтотОбъект);
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЗанятийПриИзменении(Элемент)
	Запись.КоличествоЧасов = 0;
	ЧасыТекстом = "";
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимость()

	Элементы.Декорация1.Заголовок = УЗ_ОбщийКлиентСервер.ПредставлениеЦеныТарифа(Новый Структура(
		"Сумма, КоличествоЧасов, КоличествоУроков", Запись.Сумма, Запись.КоличествоЧасов, Запись.КоличествоУроков));
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	ОбновитьВидимость();
КонецПроцедуры
